// 1) Реализуйте функцию уникализации значений в массиве

const unique = (array) => {
    let arr = array.filter((a, b)=> {
        return array.indexOf(a) == b
    })
    console.log(arr)
};

unique([1, 1, 3, 2, 2, 5, 7, 7, 7, 5, 1, 3, 4, 2, 4, 10]); // => [1, 2, 3, 4, 5, 7]

// ======================================================================

// 2) Раскройте все вложенности массива

// const flatArray = (nestedArray) => {
//   return nestedArray.flat(Infinity)
// };

// console.log(flatArray([1, [2, 3, [4, 5, 6, [7, [8, 9]]]]])); // => [1, 2, 3, 4, 5, 6, 7, 8, 9]

// ======================================================================

// 3) Просуммируйте значения дерева

//   const sumTreeBranches = (tree) => {
//     // ...
//   }

//   sumTreeBranches({
//    value: 3,
//    children: [
//      {
//        value: 2,
//        children: [
//          {
//            value: 5,
//            children: [
//              { value: 1 },
//              { value: 2 }
//            ]
//          },
//          { value: 4 },
//          { value: 1 }
//        ]
//      }
//    ]
//   }) // => 18

// ======================================================================

/** 
  4) Напишите get запрос для загрузки файла
     Условная структура:
      --folder
      ----tasks.js
      ----example.txt
  
      При запросе должен скачиваться файл
  */

//   _.get('/download', (res, req) => {
//     // ...
//   })

// ======================================================================
